In [3]:
import pandas as pd

In [5]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Unique Values

In [6]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [10]:
# pandas have a len method itself
df['col2'].nunique()

3

In [11]:
len(df['col2'].unique())

3

In [12]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Selecting Data

In [19]:
df[(df['col1'] > 0) & (df['col2'] == 444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

Applying fuctions

In [20]:
def mult(x):
    return x*2

In [21]:
df['col2'].apply(mult)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [24]:
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [26]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [27]:
df['col1'].sum()

10

Permanently removing column

In [29]:
del df['col1']

In [30]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

Get index names

In [31]:
df.columns

Index(['col2', 'col3'], dtype='object')

Sorted values

In [37]:
df.sort_values('col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

Null values

In [38]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

Drop values "inplace=True" for permanently

In [40]:
df.drop('col2', axis=1)

  col3
0  abc
1  def
2  ghi
3  xyz

Filling NaN values

In [41]:
import numpy as np

In [42]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [43]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

Using pivot

In [44]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

dfpivot = pd.DataFrame(data)

In [45]:
dfpivot

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [46]:
dfpivot.pivot(index=['A','B'], columns='C', values='D')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN